etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/ESP32D0WD/ESP32_Eth_Driver.cpp
/**
 *****************************************************************************************
 * @file            ESP32_Eth_Driver.cpp Header File for interface class.
 *
 * @brief           The file contains ESP32_Eth_Driver.cpp, an interface class required
 *
 * @details
 * @copyright       2021 Eaton Corporation. All Rights Reserved.
 * @note            Eaton Corporation claims proprietary rights to the material disclosed
 *                  here on.  This technical information may not be reproduced or used
 *                  without direct written permission from Eaton Corporation.
 *****************************************************************************************
 */

#include "ESP32_Eth_Driver.h"
#include "esp_err.h"
#include "esp32/rom/ets_sys.h"
#include "hal/emac.h"
#include "driver/periph_ctrl.h"
#include "driver/gpio.h"
#include "uC_Base.h"
#include "OS_Tasker.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "Ethernet_Debug.h"
#include "Babelfish_Debug.h"

/*************************************************************
 * Function Declarations
 **************************************************************/
static IRAM_ATTR void EMAC_ISR_Handler( void* args );

static void EMAC_Rx_Task( void* arg );

/*************************************************************
 * Global Variables
 **************************************************************/
TaskHandle_t ESP32_Eth_Driver::m_rx_task_hdl = NULL;
extern uint8_t* Tx_Buf;
eth_dma_tx_descriptor_t* desc_iter = nullptr;
/*************************************************************
 * MACRO and Static Variables
 **************************************************************/
#define PHY_OPERATION_TIMEOUT_US ( DELAY_1000_MS )

static const uint16_t DELAY_1000_MS = 1000U;
static const uint8_t DELAY_100_MS = 100U;
static const uint8_t DELAY_10_MS = 10U;
static const uint8_t SPEED_10MBPS = 1U;
static const uint8_t SPEED_100MBPS = 2U;
static const uint8_t HALF_DUPLEX = 0U;
static const uint8_t FULL_DUPLEX = 1U;
static const uint8_t RESET_TIMEOUT_DIVISOR = 10U;
static const uint16_t STACK_DEPTH = 4096;
static const uint8_t MEM_ALLOC_NUM_1 = 1U;
static const uint8_t TASK_PRIORITY_19 = 19U;
static const uint16_t COUNTER_READ_MAX = 1000U;
static const uint16_t COUNTER_WRITE_MAX = 100U;
static const uint8_t TWO_BYTE = 16U;
static const uint8_t TX_WAIT_INIT = 0U;
static const uint8_t TX_WAIT_MAX = 90U;

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
ESP32_Eth_Driver::ESP32_Eth_Driver( eth_mac_config_t mac_config, uint8_t* mac_address,
									dcid_emac_params_t const* emac_dcids ) :
	m_rx_frame_fptr( nullptr ),
	m_netif( nullptr ),
	m_isr_need_yield( false ),
	m_frames_remain( 0U ),
	m_free_desc( 0U ),
	m_mac_config( mac_config ),
	m_intr_hdl( nullptr ),
	DMA_Tx_Desc_To_Set( nullptr ),
	DMA_Rx_Desc_To_Get( nullptr )
{
	m_hal = { };
	m_addr[0] = 0;
	DMA_Tx_Dscr_Tab[0].Buffer1Addr = 0;
	DMA_Tx_Dscr_Tab[0].Buffer2NextDescAddr = 0;
	DMA_Tx_Dscr_Tab[0].Reserved1 = 0;
	DMA_Tx_Dscr_Tab[0].Reserved2 = 0;
	DMA_Tx_Dscr_Tab[0].TimeStampHigh = 0;
	DMA_Tx_Dscr_Tab[0].TimeStampLow = 0;
	DMA_Rx_Dscr_Tab[0].Buffer1Addr = 0;
	DMA_Rx_Dscr_Tab[0].Buffer2NextDescAddr = 0;
	DMA_Rx_Dscr_Tab[0].Reserved = 0;
	DMA_Rx_Dscr_Tab[0].TimeStampHigh = 0;
	DMA_Rx_Dscr_Tab[0].TimeStampLow = 0;

	esp_err_t ret_code = ESP_OK;
	void* descriptors = nullptr;

	if ( mac_address == nullptr )
	{
		ETH_DEBUG_PRINT( DBG_MSG_ERROR, "Null mac_address pointer\n\r" );
	}
	else
	{
		// coverity[var_deref_model]
		memcpy( this->m_addr, mac_address, MAC_BUFFER_SIZE );
	}
	/* alloc memory for ethernet dma descriptor */
	uint32_t desc_size = CONFIG_ETH_DMA_RX_BUFFER_NUM * sizeof( eth_dma_rx_descriptor_t ) +
		CONFIG_ETH_DMA_TX_BUFFER_NUM * sizeof( eth_dma_tx_descriptor_t );

	descriptors = heap_caps_calloc( MEM_ALLOC_NUM_1, desc_size, MALLOC_CAP_DMA );
	if ( !( descriptors ) )
	{
		ETH_DEBUG_PRINT( DBG_MSG_ERROR, "Calloc Descriptors Failed\n\r" );
	}
	int i = 0;

	/* alloc memory for ethernet dma buffer */
	for ( i = 0; i < CONFIG_ETH_DMA_RX_BUFFER_NUM; i++ )
	{
		this->m_rx_buf[i] = ( uint8_t* )heap_caps_calloc( MEM_ALLOC_NUM_1, CONFIG_ETH_DMA_BUFFER_SIZE,
														  MALLOC_CAP_DMA );
		if ( !( this->m_rx_buf[i] ) )
		{
			ETH_DEBUG_PRINT( DBG_MSG_ERROR,  "Rx_Buf : Heap_Caps_Calloc Error\r\n" );
		}
	}
	for ( i = 0; i < CONFIG_ETH_DMA_TX_BUFFER_NUM; i++ )
	{
		this->m_tx_buf[i] = ( uint8_t* )heap_caps_calloc( 1, CONFIG_ETH_DMA_BUFFER_SIZE, MALLOC_CAP_DMA );
		if ( !( this->m_tx_buf[i] ) )
		{
			ETH_DEBUG_PRINT( DBG_MSG_ERROR,  "Tx_Buf : Heap_Caps_Calloc Error\r\n" );
		}
	}

	/* initialize hal layer driver */
	emac_hal_init( &this->m_hal, descriptors, this->m_rx_buf, this->m_tx_buf );

	/* Interrupt configuration */
	ret_code = esp_intr_alloc( ETS_ETH_MAC_INTR_SOURCE, 0,
							   EMAC_ISR_Handler, this, &( this->m_intr_hdl ) );
	if ( ret_code != ESP_OK )
	{
		ETH_DEBUG_PRINT( DBG_MSG_ERROR,  "Alloc EMAC Interrupt Failed\r\n" );
	}

	/* create rx task */
	BaseType_t core_num = tskNO_AFFINITY;

	BaseType_t xReturned = xTaskCreatePinnedToCore( EMAC_Rx_Task, "emac_rx", STACK_DEPTH, this,
													TASK_PRIORITY_19, &ESP32_Eth_Driver::m_rx_task_hdl, core_num );

	if ( xReturned != pdPASS )
	{
		ETH_DEBUG_PRINT( DBG_MSG_ERROR,  "Create EMAC_Rx Task Failed\r\n" );
	}
}

void ESP32_Eth_Driver::EMAC_Init_SMI_GPIO()
{

	/* Setup SMI MDC GPIO */
	gpio_set_direction( ( gpio_num_t )m_mac_config.smi_mdc_gpio_num, GPIO_MODE_OUTPUT );
	gpio_matrix_out( ( gpio_num_t )m_mac_config.smi_mdc_gpio_num, EMAC_MDC_O_IDX, false, false );
	PIN_FUNC_SELECT( GPIO_PIN_MUX_REG[m_mac_config.smi_mdc_gpio_num], PIN_FUNC_GPIO );
	/* Setup SMI MDIO GPIO */
	gpio_set_direction( ( gpio_num_t )m_mac_config.smi_mdio_gpio_num, GPIO_MODE_INPUT_OUTPUT );
	gpio_matrix_out( ( gpio_num_t )m_mac_config.smi_mdio_gpio_num, EMAC_MDO_O_IDX, false, false );
	gpio_matrix_in( ( gpio_num_t )m_mac_config.smi_mdio_gpio_num, EMAC_MDI_I_IDX, false );
	PIN_FUNC_SELECT( GPIO_PIN_MUX_REG[m_mac_config.smi_mdio_gpio_num], PIN_FUNC_GPIO );
}

esp_err_t ESP32_Eth_Driver::EMAC_Init()
{
	/* enable peripheral clock */
	periph_module_enable( PERIPH_EMAC_MODULE );
	/* init clock, config gpio, etc */
	emac_hal_lowlevel_init( &this->m_hal );
	/* init gpio used by smi interface */
	EMAC_Init_SMI_GPIO();
	/* software reset */
	emac_hal_reset( &this->m_hal );
	uint32_t Counter = 0;

	for ( Counter = 0; Counter < this->m_mac_config.sw_reset_timeout_ms / RESET_TIMEOUT_DIVISOR; Counter++ )
	{
		if ( emac_hal_is_reset_done( &this->m_hal ) )
		{
			break;
		}
		vTaskDelay( pdMS_TO_TICKS( DELAY_10_MS ) );
	}
	if ( !( Counter < this->m_mac_config.sw_reset_timeout_ms / RESET_TIMEOUT_DIVISOR ) )
	{
		ETH_DEBUG_PRINT( DBG_MSG_ERROR, "Reset Timeout\n\r" );
		return ( ESP_ERR_TIMEOUT );
	}

	/* set smi clock */
	emac_hal_set_csr_clock_range( &this->m_hal );
	/* reset descriptor chain */
	emac_hal_reset_desc_chain( &this->m_hal );
	/* init mac registers by default */
	emac_hal_init_mac_default( &this->m_hal );
	/* init dma registers by default */
	emac_hal_init_dma_default( &this->m_hal );
	/* get emac address from efuse */
	if ( esp_read_mac( this->m_addr, ESP_MAC_ETH ) != ESP_OK )
	{
		ETH_DEBUG_PRINT( DBG_MSG_ERROR, "Fetch Ethernet MAC Address Failed\n\r" );
		return ( ESP_FAIL );
	}
	/* set MAC address to emac register */
	emac_hal_set_address( &this->m_hal, this->m_addr );
#ifdef CONFIG_PM_ENABLE
	esp_pm_lock_acquire( this->pm_lock );
#endif
	return ( ESP_OK );
}

esp_err_t ESP32_Eth_Driver::EMAC_Deinit()
{
#ifdef CONFIG_PM_ENABLE
	esp_pm_lock_release( this->pm_lock );
#endif
	emac_hal_stop( &this->m_hal );
	periph_module_disable( PERIPH_EMAC_MODULE );
	return ( ESP_OK );
}

static IRAM_ATTR void EMAC_ISR_Handler( void* args )
{
	ESP32_Eth_Driver* obj = ( ESP32_Eth_Driver* ) args;

