etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/ESP32D0WD/ESP32_Eth_Driver.cpp
	emac_hal_isr( &obj->m_hal );
	if ( obj->m_isr_need_yield )
	{
		obj->m_isr_need_yield = false;
		portYIELD_FROM_ISR();
	}
}

IRAM_ATTR void emac_hal_rx_complete_cb( void* arg )
{
	ESP32_Eth_Driver* obj = ( ESP32_Eth_Driver* ) arg;

	BaseType_t high_task_wakeup;

	/* notify receive task */
	vTaskNotifyGiveFromISR( ESP32_Eth_Driver::m_rx_task_hdl, &high_task_wakeup );
	if ( high_task_wakeup == pdTRUE )
	{
		obj->m_isr_need_yield = true;
	}
}

IRAM_ATTR void emac_hal_rx_unavail_cb( void* arg )
{
	ESP32_Eth_Driver* obj = ( ESP32_Eth_Driver* ) arg;

	BaseType_t high_task_wakeup;

	/* notify receive task */
	vTaskNotifyGiveFromISR( ESP32_Eth_Driver::m_rx_task_hdl, &high_task_wakeup );
	if ( high_task_wakeup == pdTRUE )
	{
		obj->m_isr_need_yield = true;
	}
}

IRAM_ATTR void emac_hal_rx_early_cb( void* arg )
{
	ESP32_Eth_Driver* obj = ( ESP32_Eth_Driver* ) arg;

	BaseType_t high_task_wakeup;

	/* notify receive task */
	vTaskNotifyGiveFromISR( ESP32_Eth_Driver::m_rx_task_hdl, &high_task_wakeup );
	if ( high_task_wakeup == pdTRUE )
	{
		obj->m_isr_need_yield = true;
	}
}

static void EMAC_Rx_Task( void* arg )
{
	uint8_t* buffer = nullptr;
	uint32_t length = ETH_MAX_PACKET_SIZE;
	ESP32_Eth_Driver* obj = ( ESP32_Eth_Driver* )arg;

	// coverity[no_escape]
	while ( 1 )
	{
		// block indefinitely until got notification from underlay event
		ulTaskNotifyTake( pdTRUE, portMAX_DELAY );
		do
		{
			length = ETH_MAX_PACKET_SIZE;
			/*
			 * Creating memory newly for new packet, in order to avoid buffer overwrite due to
			 * interrupt for new packet before earlier packet getting processed completely.
			 * This allocated memory is getting deallocated from Ethernet_Free_Rx_Buf_L2
			 * after data processing is completed.
			 */
			buffer = reinterpret_cast<uint8_t*>( heap_caps_calloc( MEM_ALLOC_NUM_1, length, MALLOC_CAP_8BIT ) );
			if ( buffer == nullptr )
			{
				ETH_DEBUG_PRINT( DBG_MSG_ERROR, "No Mem For Receive Buffer" );
			}
			else if ( obj->EMAC_Receive( buffer, &length ) == ESP_OK )
			{
				/* pass the buffer to stack (e.g. TCP/IP layer) */
				if ( length )
				{
					obj->m_rx_frame_fptr( obj->m_netif, buffer, length );
				}
				else
				{
					free( buffer );
				}
			}
			else
			{
				free( buffer );
			}
		} while ( obj->m_frames_remain > 0 );
	}
	vTaskDelete( NULL );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void ESP32_Eth_Driver::Init_EMAC_Hardware( void )
{
	if ( EMAC_Init() != ESP_OK )
	{
		ETH_DEBUG_PRINT( DBG_MSG_ERROR,  "EMAC_Init() Error\r\n" );
	}

	/* Taking from emac_esp32_set_link function */
	if ( esp_intr_enable( this->m_intr_hdl ) != ESP_OK )
	{
		ETH_DEBUG_PRINT( DBG_MSG_ERROR,  "Enable Interrupt Failed\r\n" );
	}
	emac_hal_start( &this->m_hal );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void ESP32_Eth_Driver::ETH_DMA_Rx_Desc_Receive_IT_Config( eth_dma_rx_descriptor_t* DMA_Rx_Desc,
														  FunctionalState New_State ) const
{
	if ( New_State != DISABLE )
	{
		/* Enable the DMA Rx Desc receive interrupt */
		DMA_Rx_Desc->RDES1.DisableInterruptOnComplete = RESET;
	}
	else
	{
		/* Disable the DMA Rx Desc receive interrupt */
		DMA_Rx_Desc->RDES1.DisableInterruptOnComplete = SET;
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void ESP32_Eth_Driver::Init_Buff_Desc( uint8_t* tx_buff, uint32_t** rx_payload,
									   uint16_t rx_buffer_size )
{
	ETH_DMA_Rx_Desc_Chain_Init( rx_payload, rx_buffer_size );
	ETH_DMA_Tx_Desc_Chain_Init( tx_buff, EMAC_Driver::ETH_TX_BUFNB );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void ESP32_Eth_Driver::ETH_DMA_Rx_Desc_Chain_Init( uint32_t** rx_payload, uint16_t rx_buffer_size )
{
	for ( uint8_t idx = 0; idx < EMAC_Driver::ETH_RX_BUFNB; idx++ )
	{
		DMA_Rx_Desc_To_Get = &DMA_Rx_Dscr_Tab[idx];

		/* Set Buffer1 size and Second Address Chained bit */
		DMA_Rx_Desc_To_Get->RDES1.SecondAddressChained = SET;
		DMA_Rx_Desc_To_Get->RDES1.ReceiveBuffer1Size = ( static_cast<uint32_t>( rx_buffer_size ) );
		/* Set the Buffer 1 Address */
		DMA_Rx_Desc_To_Get->Buffer1Addr = ( reinterpret_cast<uint32_t>( rx_payload[idx] ) );

		/* Initialize the next descriptor with the Next Desciptor Polling Enable */
		if ( idx < ( EMAC_Driver::ETH_RX_BUFNB - 1U ) )
		{
			/* Set next descriptor address register with next descriptor base address */
			DMA_Rx_Desc_To_Get->Buffer2NextDescAddr = ( reinterpret_cast<uint32_t>( DMA_Rx_Dscr_Tab + idx + 1 ) );
		}
		else
		{
			/* For last descriptor, set next descriptor address register equal to the first
			   descriptor base address */
			DMA_Rx_Desc_To_Get->Buffer2NextDescAddr = ( reinterpret_cast<uint32_t>( DMA_Rx_Dscr_Tab ) );
		}

		/* Set Own bit of the Rx descriptor Status */
		DMA_Rx_Desc_To_Get->RDES0.Own = SET;
		ETH_DMA_Rx_Desc_Receive_IT_Config( &DMA_Rx_Dscr_Tab[idx], ENABLE );
		DMA_Rx_Desc_To_Get++;
	}

	/* At initial the current descriptor shall be at position reset or 0 */
	DMA_Rx_Desc_To_Get = &DMA_Rx_Dscr_Tab[RESET];
	/* Set Receive Desciptor List Address Register */
	this->m_hal.dma_regs->dmarxbaseaddr = ( reinterpret_cast<uint32_t>( DMA_Rx_Dscr_Tab ) );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void ESP32_Eth_Driver::ETH_DMA_Tx_Desc_Chain_Init( uint8_t* tx_buff, uint32_t tx_buff_count )
{
	uint32_t count;
	eth_dma_tx_descriptor_t* DMA_Tx_Desc;

	/* Set the DMATxDescToSet pointer with the first one of the DMATxDescTab list */
	DMA_Tx_Desc_To_Set = DMA_Tx_Dscr_Tab;
	/* Fill each DMATxDesc descriptor with the right values */
	for ( count = 0U; count < tx_buff_count; count++ )
	{
		/* Get the pointer on the ith member of the Tx Desc list */
		DMA_Tx_Desc = DMA_Tx_Dscr_Tab + count;
		/* Set Second Address Chained bit */
		DMA_Tx_Desc->TDES0.SecondAddressChained = SET;

