etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/ESP32D0WD/ESP32_Eth_Driver.cpp
		/* Set Buffer1 address pointer */
		DMA_Tx_Desc->Buffer1Addr =
			reinterpret_cast<uint32_t>( ( &tx_buff[count * ETH_MAX_PACKET_SIZE] ) );

		/* Initialize the next descriptor with the Next Descriptor Polling Enable */
		if ( count < ( tx_buff_count - 1U ) )
		{
			/* Set next descriptor address register with next descriptor base address */
			DMA_Tx_Desc->Buffer2NextDescAddr =
				reinterpret_cast<uint32_t>( ( DMA_Tx_Dscr_Tab + count + 1U ) );
		}
		else
		{
			/* For last descriptor, set next descriptor address register equal to the first
			   descriptor base address */
			DMA_Tx_Desc->Buffer2NextDescAddr = reinterpret_cast<uint32_t>( DMA_Tx_Dscr_Tab );
		}
	}

	/* Set Transmit Desciptor List Address Register */
	this->m_hal.dma_regs->dmatxbaseaddr = reinterpret_cast<uint32_t>( DMA_Tx_Dscr_Tab );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
ESP32_Eth_Driver::~ESP32_Eth_Driver( void )
{
	if ( EMAC_Deinit() != ESP_OK )
	{
		ETH_DEBUG_PRINT( DBG_MSG_ERROR,  "Deinit MAC Failed\r\n" );
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void ESP32_Eth_Driver::ETH_MAC_Address_Config( uint32_t mac_addr, uint8_t* addr )
{
	emac_hal_set_address( &this->m_hal, addr );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */

void ESP32_Eth_Driver::Get_MAC_Address( uint8_t* addr ) const
{
	memcpy( addr, this->m_addr, MAC_BUFFER_SIZE );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */

void ESP32_Eth_Driver::ETH_DMA_Clear_IT_Pending_Bit( uint32_t ETH_DMA_IT )
{
	m_hal.dma_regs->dmastatus.val = ETH_DMA_IT;
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
Flag_Status ESP32_Eth_Driver::ETH_Get_DMA_Flag_Status( uint8_t ETH_DMA_FLAG )
{
	Flag_Status bitstatus = RESET;

	if ( ( static_cast<bool>( ( m_hal.dma_regs->dmastatus.val & ETH_DMA_FLAG ) != RESET ) ) )
	{
		bitstatus = SET;
	}
	else
	{
		bitstatus = RESET;
	}
	return ( bitstatus );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void ESP32_Eth_Driver::ETH_DMA_IT_Config( uint32_t ETH_DMA_IT, FunctionalState New_State ) const
{
	if ( New_State != DISABLE )
	{
		/* Enable the selected ETHERNET DMA interrupts */
		m_hal.dma_regs->dmain_en.val |= ETH_DMA_IT;
	}
	else
	{
		/* Disable the selected ETHERNET DMA interrupts */
		m_hal.dma_regs->dmain_en.val &= ( ~( static_cast<uint32_t>( ETH_DMA_IT ) ) );
	}
}

#ifndef USE_Delay
/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void ESP32_Eth_Driver::ETH_Delay( uint32_t nCount )
{
	for ( uint32_t Index = nCount; Index != RESET; Index-- )
	{}
}

#endif	/* USE_Delay*/

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
esp_err_t ESP32_Eth_Driver::EMAC_Read_PHY_Reg( uint32_t phy_addr, uint32_t phy_reg, uint32_t* reg_value )
{
	esp_err_t ret = ESP_OK;

	if ( !reg_value )
	{
		ETH_DEBUG_PRINT( DBG_MSG_ERROR,  "Can't Set Reg_Value To Null\r\n" );
		return ( ESP_ERR_INVALID_ARG );
	}
	emac_hal_set_phy_cmd( &this->m_hal, phy_addr, phy_reg, false );
	/* polling the busy flag */
	uint32_t Counter = 0;
	bool busy;

	do
	{
		ets_delay_us( DELAY_1000_MS );
		busy = emac_hal_is_mii_busy( &this->m_hal );
		Counter += COUNTER_READ_MAX;
	} while ( busy && Counter < PHY_OPERATION_TIMEOUT_US );
	if ( busy )
	{
		ETH_DEBUG_PRINT( DBG_MSG_ERROR,  "PHY is Busy\r\n" );
		return ( ESP_ERR_TIMEOUT );
	}
	/* Store value */
	*reg_value = emac_hal_get_phy_data( &this->m_hal );
	return ( ret );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
esp_err_t ESP32_Eth_Driver::EMAC_Write_PHY_Reg( uint32_t phy_addr, uint32_t phy_reg, uint32_t reg_value )
{
	esp_err_t ret = ESP_OK;

	if ( emac_hal_is_mii_busy( &this->m_hal ) )
	{
		ETH_DEBUG_PRINT( DBG_MSG_ERROR,  "PHY Is Busy\r\n" );
		ret = ESP_ERR_INVALID_STATE;
	}

	emac_hal_set_phy_data( &this->m_hal, reg_value );
	emac_hal_set_phy_cmd( &this->m_hal, phy_addr, phy_reg, true );
	/* polling the busy flag */
	uint32_t Counter = 0;
	bool busy;

	do
	{
		ets_delay_us( DELAY_100_MS );
		busy = emac_hal_is_mii_busy( &this->m_hal );
		Counter += COUNTER_WRITE_MAX;
	} while ( busy && Counter < PHY_OPERATION_TIMEOUT_US );
	if ( busy )
	{
		ETH_DEBUG_PRINT( DBG_MSG_ERROR,  "PHY Is Busy\r\n" );
		ret = ESP_ERR_TIMEOUT;
	}
	return ( ret );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
BOOL ESP32_Eth_Driver::SMIRead16Bits( uint16_t phy_addr, uint16_t reg_addr, uint16_t* read_ptr )
{
	esp_err_t esp_ret;
	bool ret = false;

	esp_ret = EMAC_Read_PHY_Reg( ( uint32_t ) phy_addr, ( uint32_t ) reg_addr, ( uint32_t* ) read_ptr );
	if ( esp_ret == ESP_OK )
	{
		ret = true;
	}
	return ( ret );
}

