etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/ESP32D0WD/ESP32_Eth_Driver.cpp
/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
BOOL ESP32_Eth_Driver::SMIWrite16Bits( uint16_t phy_addr, uint16_t reg_addr, const uint16_t* write_ptr )
{
	esp_err_t esp_ret;
	bool ret = false;

	esp_ret = EMAC_Write_PHY_Reg( ( uint32_t )phy_addr, ( uint32_t )reg_addr, ( uint32_t )*write_ptr );
	if ( esp_ret == ESP_OK )
	{
		ret = true;
	}
	return ( ret );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
BOOL ESP32_Eth_Driver::SMIRead32Bits( uint16_t sys_reg_addr, uint32_t* read_ptr )
{
	uint16_t lo_word = 0xFFFFU;
	uint16_t hi_word = 0xFFFFU;

	bool_t success = false;

	bool lo_success = SMIRead16Bits( SMI_SYS_REG_TO_PHY_ADDR( sys_reg_addr ),
									 SMI_SYS_REG_TO_LO_REG_ADDR( sys_reg_addr ),
									 &lo_word );

	bool hi_success = SMIRead16Bits( SMI_SYS_REG_TO_PHY_ADDR( sys_reg_addr ),
									 SMI_SYS_REG_TO_HI_REG_ADDR( sys_reg_addr ),
									 &hi_word );

	if ( lo_success && hi_success )
	{
		*read_ptr = ( ( static_cast<uint32_t>( hi_word ) ) << 16U )
			| ( static_cast<uint32_t>( lo_word ) );
		success = true;
	}

	return ( static_cast<bool>( success ) );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
BOOL ESP32_Eth_Driver::SMIWrite32Bits( uint16_t sys_reg_addr, const uint32_t* write_ptr )
{
	bool success = false;
	uint16_t lo_word = static_cast<uint16_t>( ( ( *write_ptr ) & 0xFFFFU ) );
	uint16_t hi_word = static_cast<uint16_t>( ( ( *write_ptr ) >> TWO_BYTE ) );

	bool lo_success = SMIWrite16Bits( SMI_SYS_REG_TO_PHY_ADDR( sys_reg_addr ),
									  SMI_SYS_REG_TO_LO_REG_ADDR( sys_reg_addr ),
									  &lo_word );

	bool hi_success = SMIWrite16Bits( SMI_SYS_REG_TO_PHY_ADDR( sys_reg_addr ),
									  SMI_SYS_REG_TO_HI_REG_ADDR( sys_reg_addr ),
									  &hi_word );

	if ( lo_success && hi_success )
	{
		success = true;
	}
	return ( static_cast<bool>( success ) );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
uint8_t* ESP32_Eth_Driver::Get_Next_Avail_Desc_Buff( void )
{
	return ( reinterpret_cast<uint8_t*>( desc_iter->Buffer1Addr ) );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void ESP32_Eth_Driver::Wait_Tx_Ready( void )
{
	uint32_t ulAttempts = TX_WAIT_INIT;

	while ( static_cast<bool>( ( DMA_Tx_Desc_To_Set->TDES0.Own ) != RESET ) )
	{
		/* Return ERROR: OWN bit set */
		OS_Tasker::Delay( 1U );

		ulAttempts++;

		if ( ulAttempts > TX_WAIT_MAX )
		{
			DMA_Tx_Desc_To_Set->TDES0.Own = 0;
			break;
		}

	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void ESP32_Eth_Driver::Tx_Frame( uint32_t Length )
{
	ESP32_Eth_Driver::emac_hal_transmit_frame( &this->m_hal, Tx_Buf, Length );
}

esp_err_t ESP32_Eth_Driver::EMAC_Set_Speed( uint8_t speed )
{
	esp_err_t ret = ESP_OK;

	switch ( speed )
	{
		case SPEED_10MBPS:
			emac_hal_set_speed( &this->m_hal, EMAC_SPEED_10M );
			ETH_DEBUG_PRINT( DBG_MSG_DEBUG,  "Working In 10Mbps\r\n" );
			break;

		case SPEED_100MBPS:
			emac_hal_set_speed( &this->m_hal, EMAC_SPEED_100M );
			ETH_DEBUG_PRINT( DBG_MSG_DEBUG,  "Working In 100Mbps\r\n" );
			break;

		default:
			ETH_DEBUG_PRINT( DBG_MSG_DEBUG,  "Unknown Speed\r\n" );
			ret = ESP_ERR_INVALID_ARG;
			break;
	}
	return ( ret );
}

esp_err_t ESP32_Eth_Driver::EMAC_Set_Duplex( uint8_t duplex )
{
	esp_err_t ret = ESP_OK;

	switch ( duplex )
	{
		case HALF_DUPLEX:
			emac_hal_set_duplex( &this->m_hal, EMAC_DUPLEX_HALF );
			ETH_DEBUG_PRINT( DBG_MSG_DEBUG,  "Working In Half Duplex\r\n" );
			break;

		case FULL_DUPLEX:
			emac_hal_set_duplex( &this->m_hal, EMAC_DUPLEX_FULL );
			ETH_DEBUG_PRINT( DBG_MSG_DEBUG,  "Working In Full Duplex\r\n" );
			break;

		default:
			ETH_DEBUG_PRINT( DBG_MSG_DEBUG,  "Unknown  Mode\r\n" );
			ret = ESP_ERR_INVALID_ARG;
			break;
	}
	return ( ret );
}

// coverity[no_escape]
esp_err_t ESP32_Eth_Driver::EMAC_Receive( uint8_t* buf, uint32_t* length )
{
	esp_err_t ret = ESP_OK;

	if ( length != NULL )
	{
		uint32_t expected_len = *length;

		if ( !( buf && length ) )
		{
			ETH_DEBUG_PRINT( DBG_MSG_ERROR,  "Can't Set Buf And Length To Null\r\n" );
			ret = ESP_ERR_INVALID_ARG;
		}
		uint32_t receive_len = emac_hal_receive_frame( &this->m_hal, buf, expected_len, &this->m_frames_remain,
													   &this->m_free_desc );

		/* We need to check the return value in case the buffer size is not enough */
		if ( !( expected_len >= receive_len ) )
		{
			ETH_DEBUG_PRINT( DBG_MSG_ERROR,  "Received Buffer Longer Than Expected\r\n" );
			ret = ESP_ERR_INVALID_SIZE;
		}
		*length = receive_len;
	}
	return ( ret );
}

void ESP32_Eth_Driver::Receive_Frame_Attach_FuncPtr( Receive_Frame_Func_Ptr* rx_frame_fptr, void* net_if )
{
	this->m_rx_frame_fptr = rx_frame_fptr;
	this->m_netif = net_if;
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void ESP32_Eth_Driver::Update_PHY_Config_To_MAC( uint8_t speed, uint8_t duplex )
{
	if ( EMAC_Set_Speed( ( uint8_t ) speed ) != ESP_OK )
	{
		ETH_DEBUG_PRINT( DBG_MSG_ERROR,  "Failed To Set Speed\r\n" );
	}
	if ( EMAC_Set_Duplex( ( uint8_t ) duplex ) != ESP_OK )
	{
		ETH_DEBUG_PRINT( DBG_MSG_ERROR,  "Failed To Set Mode\r\n" );
	}
}

