etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/ESP32D0WD/ESP32_Eth_Driver.cpp
/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
bool ESP32_Eth_Driver::Wait_Rx_Data_Available( void ) const
{
	return ( !( static_cast<bool>( ( DMA_Rx_Desc_To_Get->RDES0.Own ) != RESET ) ) );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
data_states_t ESP32_Eth_Driver::Get_Next_Rx_Pkt( uint32_t* new_payload, uint8_t* pkt_index )
{
	static data_states_t statemachine = INIT;
	data_states_t return_value;
	static uint8_t dma_desc_num = 0U;
	bool error;
	bool fs_bit;
	bool ls_bit;
	bool dma_suspend;
	static bool first_packet_received = false;

	// block indefinitely until got notification from underlay event
	ulTaskNotifyTake( pdTRUE, portMAX_DELAY );

	fs_bit = static_cast<bool>( DMA_Rx_Desc_To_Get->RDES0.FirstDescriptor );
	ls_bit = static_cast<bool>( DMA_Rx_Desc_To_Get->RDES0.LastDescriptor );

	error =
		( ( ( static_cast<bool>( ( DMA_Rx_Desc_To_Get->RDES0.ErrSummary ) ) ) != RESET ) ||
		  ( !first_packet_received && !fs_bit ) || ( fs_bit && first_packet_received ) ||
		  ( new_payload == _NULL ) );

	dma_suspend = static_cast<bool>( ( this->m_hal.dma_regs->dmastatus.recv_buf_unavail ) != RESET );


	DMA_Rx_Desc_To_Get->RDES0.Own = SET;
	if ( dma_suspend )
	{
		/* Clear RBUS ETHERNET DMA flag */
		this->m_hal.dma_regs->dmastatus.recv_buf_unavail = SET;
		/* Resume DMA reception */
		this->m_hal.dma_regs->dmarxpolldemand = RESET;
	}
	if ( _NULL != new_payload )
	{
		DMA_Rx_Desc_To_Get->Buffer1Addr = reinterpret_cast<uint32_t>( new_payload );
	}
	DMA_Rx_Desc_To_Get = reinterpret_cast<eth_dma_rx_descriptor_t*>( DMA_Rx_Desc_To_Get->Buffer2NextDescAddr );

	if ( error )
	{
		statemachine = ERROR_STATE;
		first_packet_received = false;
	}
	else
	{
		if ( first_packet_received )
		{
			if ( ls_bit )
			{
				statemachine = LAST;
				first_packet_received = false;
			}
			else
			{
				statemachine = INTERIM;
			}
		}
		else
		{
			if ( fs_bit )
			{
				statemachine = START;
				first_packet_received = true;
				if ( ls_bit )
				{
					statemachine = SINGLE_PKT_FRM;
					first_packet_received = false;
				}
			}
		}
	}

	/* To keep the track of current DMA descriptor */
	dma_desc_num++;
	/* DAM descriptor range spans from 0-9 instead of 1-10*/
	*pkt_index = ( dma_desc_num - 1U );
	if ( EMAC_Driver::ETH_RX_BUFNB == dma_desc_num )
	{
		dma_desc_num = 0U;
		/* Reset the dma descriptor number as descriptor are chained in ring */
	}

	return_value = statemachine;
	if ( ( ERROR_STATE == statemachine ) || ( LAST == statemachine ) ||
		 ( SINGLE_PKT_FRM == statemachine ) )
	{
		statemachine = INIT;
	}

	return ( return_value );
}

uint32_t ESP32_Eth_Driver::emac_hal_transmit_frame( emac_hal_context_t* hal, uint8_t* buf, uint32_t length )
{
	/* Get the number of Tx buffers to use for the frame */
	uint32_t bufcount = 0;
	uint32_t lastlen = length;
	uint32_t sentout = 0;

	while ( lastlen > CONFIG_ETH_DMA_BUFFER_SIZE )
	{
		lastlen -= CONFIG_ETH_DMA_BUFFER_SIZE;
		bufcount++;

	}
	if ( lastlen )
	{
		bufcount++;
	}
	if ( bufcount > CONFIG_ETH_DMA_TX_BUFFER_NUM )
	{}

	desc_iter = hal->tx_desc;
	/* A frame is transmitted in multiple descriptor */
	for ( int i = 0; i < bufcount; i++ )
	{
		/* Check if the descriptor is owned by the Ethernet DMA (when 1) or CPU (when 0) */
		if ( desc_iter->TDES0.Own != EMAC_DMADESC_OWNER_CPU )
		{
			Wait_Tx_Ready();
		}
		/* Clear FIRST and LAST segment bits */
		desc_iter->TDES0.FirstSegment = 0;
		desc_iter->TDES0.LastSegment = 0;
		desc_iter->TDES0.InterruptOnComplete = 0;
		if ( i == 0 )
		{
			/* Setting the first segment bit */
			desc_iter->TDES0.FirstSegment = 1;
		}
		if ( i == ( bufcount - 1 ) )
		{
			/* Setting the last segment bit */
			desc_iter->TDES0.LastSegment = 1;
			/* Enable transmit interrupt */
			desc_iter->TDES0.InterruptOnComplete = 1;
			/* Program size */
			desc_iter->TDES1.TransmitBuffer1Size = lastlen;
			/* copy data from uplayer stack buffer */
			memcpy( Get_Next_Avail_Desc_Buff(), buf + i * CONFIG_ETH_DMA_BUFFER_SIZE, lastlen );
			sentout += lastlen;
		}
		else
		{
			/* Program size */
			desc_iter->TDES1.TransmitBuffer1Size = CONFIG_ETH_DMA_BUFFER_SIZE;
			/* copy data from uplayer stack buffer */
			memcpy( Get_Next_Avail_Desc_Buff(), buf + i * CONFIG_ETH_DMA_BUFFER_SIZE, CONFIG_ETH_DMA_BUFFER_SIZE );
			sentout += CONFIG_ETH_DMA_BUFFER_SIZE;
		}
		/* Point to next descriptor */
		desc_iter = ( eth_dma_tx_descriptor_t* )( desc_iter->Buffer2NextDescAddr );
	}

	/* Set Own bit of the Tx descriptor Status: gives the buffer back to ETHERNET DMA */
	for ( int i = 0; i < bufcount; i++ )
	{
		hal->tx_desc->TDES0.Own = EMAC_DMADESC_OWNER_DMA;
		hal->tx_desc = ( eth_dma_tx_descriptor_t* )( hal->tx_desc->Buffer2NextDescAddr );
	}
	hal->dma_regs->dmatxpolldemand = 0;
	return ( sentout );

}
